W9D1/artproject/app/controllers/users_controller.rb

  def index
    if params[:query]
      users = User.where('username LIKE ?', "%#{params[:query]}%")
    else
      users = User.all
---
SELECT "users".* FROM "users"