W9D4/99CatsAuth/app/controllers/orders_controller.rb

INSERT INTO "orders" ("total", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["total", 1], ["description", "new order testing"], ["created_at", "2019-12-20 05:26:56.143137"], ["updated_at", "2019-12-20 05:26:56.143137"]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "description" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["description", "new order testing update total"], ["updated_at", "2019-12-20 05:27:23.814026"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)