W9D1/rproject/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "coco"], ["updated_at", "2019-11-05 14:26:29.504712"], ["id", 1]]
---
    def update
        user = User.find(params[:id])
        user.update!(user_params)